<?php include "header.php"; ?>

<h1>Завдання 1</h1>
У форму вводиться число N. Знайти всі досконалі числа до N.
Досконале число - це таке число, що дорівнює сумі всіх своїх дільників,
крім себе самого. Наприклад, число 6 є досконалим, тому що крім себе
самого ділиться на числа 1, 2 і 3, які в сумі дають 6.
<h1>Завдання 2</h1>
У форму вводиться текст, слова в якому розділені пробілами і
розділовими знаками. Вилучити з цього тексту всі слова найбільшої
довжини. (Слів найбільшої довжини може бути декілька).
<h1>Завдання 3</h1>
Вводяться N натуральних чисел більше 2. Підрахувати, скільки серед
них простих чисел.
<h1>Завдання 4</h1>
<p>Політичне життя однієї країни дуже жваве. У країні діє K політичних
партій, кожна з яких регулярно оголошує національний страйк. Дні, коли
хоча б одна з партій оголошує страйк, за умови, що це не субота або неділя
(коли і так ніхто не працює), завдають великої шкоди економіці країни.</p>
<p>i-та партія оголошує страйки строго кожні bi днів, починаючи з дня з
номером ai. Тобто i-та партія оголошує страйки в дні ai, ai + bi, ai + 2bi і т.д.
Якщо в якийсь день кілька партій оголошує страйк, то це вважається загальнонаціональним страйком.</p>
У календарі країни N днів, пронумерованих від 1 до N. Перший день
року є понеділком, шостий і сьомий дні року - вихідні, тиждень складається
з семи днів.
<p class="text_bold">Вхідні дані</p>
 <p>
Програма отримує на вхід число днів в році N (1&lt;N&lt;1000000) і число політичних партій K (1&lt;K&lt;100). Далі йде K рядків, що описують графіки проведення страйків. i-й рядок містить числа ai і bi (1&lt;ai,bi&lt;N).</p>
<p class="text_bold">Вихідні дані</p>
Виведіть єдине число: кількість страйків, що відбулися протягом року.
Примітка
Перша партія оголошує страйки в дні 2, 5, 8, 11, 14, 17. Друга партія
оголошує страйки в дні 3, 8, 13, 18. Третя партія - в дні 9 і 17. Дні номер 6,
7, 13, 14 є вихідними. Таким чином, загальнонаціональні страйки пройдуть в
дні 2, 3, 5, 8, 9, 11, 17, 18.

<h1>Завдання 5</h1>
<p>Задано текст. Словом вважається послідовність непробільних символів,
які йдуть підряд. Слова розділені одним або більшим числом пробілів або
символами кінця рядка.
Для кожного слова з цього тексту підрахуйте, скільки разів воно
зустрічалося в цьому тексті раніше. Використайте словники.</p>
<p class="text_bold">Приклад:</p>
<table class="pruklad_5">
    <tr><td>Ввід</td><td>Вивід</td> </tr>
    <tr><td>one two one two three</td><td>0 0 1 1 0</td></tr>
    <tr><td>She sells sea shells on the sea
shore;
The shells that she sells are sea
shells I'm sure.
So if she sells sea shells on the
sea shore,
I'm sure that the shells are sea
shore shells.</td><td>0 0 0 0 0 0 1 0 0 1 0 0 1 0 2 2 0 0 0 0 1 2 3 3
        1 1 4 0 1 0 1 2 4 1 5 0 0</td></tr>
   
</table>

<h1>Завдання 6</h1>
Змагання з гри «Тетріс-онлайн» проводяться за такими правилами:
Кожен учасник реєструється на сайті гри під певним ігровим ім'ям. Імена
учасників не повторюються.
Чемпіонат проводиться протягом певного часу. У будь-який момент цього
часу будь-який зареєстрований учасник може зайти на сайт чемпіонату і
почати залікову гру. Після закінчення гри її результат (кількість балів)
фіксується і заноситься до протоколу.
Учасники мають право грати кілька разів. Кількість спроб одного учасника
не обмежується. Остаточний результат учасника визначається по одній грі,
кращою для даного учасника. Більш високе місце в змаганнях займає
учасник, що показав кращий результат. При рівності результатів більш
високе місце займає учасник, раніше показав кращий результат.
В ході змагань заповнюється протокол, кожен рядок якого описує одну гру
і містить результат учасника і його ігрове ім'я. Протокол формується в
реальному часі по ходу проведення чемпіонату, тому рядки в ньому
розташовані в порядку проведення ігор: чим раніше зустрічається рядок у
протоколі, тим раніше закінчилася відповідна цьому рядку гра.
Напишіть програму, яка за даними протоколу визначає переможця і
призерів. Гарантується, що в чемпіонаті бере участь не менше трьох гравців.
<p class="text_bold">Приклад:</p>
<table>
    <tr><td>Ввід</td><td>Вивід</td></tr>
    <tr><td>9</td><td>1 місце. Qwerty (197128)</td></tr>
    <tr><td>69485 Jack</td><td>2 місце. Alex (95715)</td></tr>
    <tr><td>95715 qwerty</td><td>3 місце. Jack (95715)</td></tr>
    <tr><td>95715 Alex</td><td></td></tr>
    <tr><td>83647 M</td><td></td></tr>
    <tr><td>197128 qwerty</td><td></td></tr>
    <tr><td>95715 Jack</td><td></td></tr>
    <tr><td>93289 Alex</td><td></td></tr>
    <tr><td>95715 Alex</td><td></td></tr>
    <tr><td>95715 M</td><td></td></tr>
</table>
<?php include "footer.php"; ?>